[
  {
    "ipc_section": "302",
    "ipc_title": "Punishment for murder",
    "bns_section": "103",
    "bns_title": "Punishment for murder",
    "change_type": "Modified",
    "summary_of_change": "Retains death or life imprisonment; fine is now mandatory. Language made gender-neutral.",
    "text_ipc": "Whoever commits murder shall be punished with death, or imprisonment for life, and shall also be liable to fine.",
    "text_bns": "(1) Whoever commits murder shall be punished with death or imprisonment for life, and shall also be liable to fine..\n(2) When a group of five or more persons acting in concert commits murder on the ground of race, caste or community, sex, place of birth, language, personal belief or any other similar ground each member of such group shall be punished with death or with imprisonment for life, and shall also be liable to fine."
  },
  {
    "ipc_section": "307",
    "ipc_title": "Attempt to murder",
    "bns_section": "109",
    "bns_title": "Attempt to murder",
    "change_type": "Modified",
    "summary_of_change": "Similar provisions. Life imprisonment remains for causing hurt. Classification of 'offender under life sentence' retained.",
    "text_ipc": "Whoever does any act with such intention or knowledge, and under such circumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and, if hurt is caused to any person by such act, the offender shall be liable either to imprisonment for life, or to such punishment as is hereinbefore mentioned.\nAttempts by Life Convicts: When any person offending under this section is under sentence of imprisonment for life, he may, if hurt is caused, be punished with death.",
    "text_bns": "(1) Whoever does any act with such intention or knowledge, and under such circumstances that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine; and if hurt is caused to any person by such act, the offender shall be liable either to imprisonment for life, or to such punishment as is hereinbefore mentioned.\n(2) When any person offending under sub-section (1) is under sentence of imprisonment for life, he may, if hurt is caused, be punished with death or with imprisonment for life, which shall mean the remainder of that person's natural life.\nIllustrations.\n(a) A shoots at Z with intention to kill him, under such circumstances that, if death ensued, A would be guilty of murder. A is liable to punishment under this section.\n(b) A, with the intention of causing the death of a child of tender years, exposes it in a desert place. A has committed the offence defined by this section, though the death of the child does not ensue.\n(c) A, intending to murder Z, buys a gun and loads it. A has not yet committed the offence. A fires the gun at Z. He has committed the offence defined in this section, and, if by such firing he wounds Z, he is liable to the punishment provided by the latter part of sub-section (1).\n(d) A, intending to murder Z by poison, purchases poison and mixes the same with food which remains in A’s keeping; A has not yet committed the offence defined in this section. A places the food on Z’s table or delivers it to Z’s servants to place it on Z’s table. A has committed the offence defined in this section."
  },
  {
    "ipc_section": "379",
    "ipc_title": "Punishment for theft",
    "bns_section": "303",
    "bns_title": "Theft",
    "change_type": "Expanded",
    "summary_of_change": "Community service added as a potential punishment for first-time offenders (snatching) if value is low and property returned.",
    "text_ipc": "Whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
    "text_bns": "(1) Whoever, intending to take dishonestly any movable property out of the possession of any person without that person’s consent, moves that property in order to such taking, is said to commit theft.\nExplanation 1.—A thing so long as it is attached to the earth, not being movable property, is not the subject of theft; but it becomes capable of being the subject of theft as soon as it is severed from the earth.\nExplanation 2.—A moving effected by the same act which affects the severance may be a theft.\nExplanation 3.—A person is said to cause a thing to move by removing an obstacle which prevented it from moving or by separating it from any other thing, as well as by actually moving it.\nExplanation 4.—A person, who by any means causes an animal to move, is said to move that animal, and to move everything which, in consequence of the motion so caused, is moved by that animal.\nExplanation 5.—The consent mentioned in this section may be express or implied, and may be given either by the person in possession, or by any person having for that purpose authority either express or implied.\nIllustrations.\n\n(a) A cuts down a tree on Z’s ground, with the intention of dishonestly taking the tree out of Z’s possession without Z’s consent. Here, as soon as A has severed the tree in order to such taking, he has committed theft.\n(b) A puts a bait for dogs in his pocket, and thus induces Z’s dog to follow it. Here, if A’s intention be dishonestly to take the dog out of Z’s possession without Z’s consent. A has committed theft as soon as Z’s dog has begun to follow A.\n(c) A meets a bullock carrying a box of treasure. He drives the bullock in a certain direction, in order that he may dishonestly take the treasure. As soon as the bullock begins to move, A has committed theft of the treasure.\n(d) A being Z’s servant, and entrusted by Z with the care of Z’s plate, dishonestly runs away with the plate, without Z’s consent. A has committed theft.\n(e) Z, going on a journey, entrusts his plate to A, the keeper of a warehouse, till Z shall return. A carries the plate to a goldsmith and sells it. Here the plate was not in Z’s possession. It could not therefore be taken out of Z’s possession, and A has not committed theft, though he may have committed criminal breach of trust.\n(f) A finds a ring belonging to Z on a table in the house which Z occupies. Here the ring is in Z’s possession, and if A dishonestly removes it, A commits theft.\n(g) A finds a ring lying on the highroad, not in the possession of any person. A, by taking it, commits no theft, though he may commit criminal misappropriation of property.\n(h) A sees a ring belonging to Z lying on a table in Z’s house. Not venturing to misappropriate the ring immediately for fear of search and detection, A hides the ring in a place where it is highly improbable that it will ever be found by Z, with the intention of taking the ring from the hiding place and selling it when the loss is forgotten. Here A, at the time of first moving the ring, commits theft.\n(i) A delivers his watch to Z, a jeweler, to be regulated. Z carries it to his shop. A, not owing to the jeweler any debt for which the jeweler might lawfully detain the watch as a security, enters the shop openly, takes his watch by force out of Z’s hand, and carries it away. Here A, though he may have committed criminal trespass and assault, has not committed theft, in as much as what he did was not done dishonestly.\n(j) If A owes money to Z for repairing the watch, and if Z retains the watch lawfully as a security for the debt, and A takes the watch out of Z’s possession, with the intention of depriving Z of the property as a security for his debt, he commits theft, in as much as he takes it dishonestly.\n(k) Again, if A, having pawned his watch to Z, takes it out of Z’s possession without Z’s consent, not having paid what he borrowed on the watch, he commits theft, though the watch is his own property in as much as he takes it dishonestly.\n(l) A takes an article belonging to Z out of Z’s possession without Z’s consent, with the intention of keeping it until he obtains money from Z as a reward for its restoration. Here A takes dishonestly; A has therefore committed theft.\n(m) A, being on friendly terms with Z, goes into Z’s library in Z’s absence, and takes away a book without Z’s express consent for the purpose merely of reading it, and with the intention of returning it. Here, it is probable that A may have conceived that he had Z’s implied consent to use Z’s book. If this was A’s impression, A has not committed theft.\n(n) A asks charity from Z’s wife. She gives A money, food and clothes, which A knows to belong to Z her husband. Here it is probable that A may conceive that Z’s wife is authorised to give away alms. If this was A’s impression, A has not committed theft.\n(o) A is the paramour of Z’s wife. She gives a valuable property, which A knows to belong to her husband Z, and to be such property as she has no authority from Z to give. If A takes the property dishonestly, he commits theft.\n(p) A, in good faith, believing property belonging to Z to be A’s own property, takes that property out of Z’s possession. Here, as A does not take dishonestly, he does not commit theft.\n(2) Whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both and in case of second or subsequent conviction of any person under this section, he shall be punished with rigorous imprisonment for a term which shall not be less than one year but which may extend to five years and with fine:\nProvided that in cases of theft where the value of the stolen property is less than five thousand rupees, and a person is convicted for the first time, shall upon return of the value of property or restoration of the stolen property, shall be punished with community service."
  },
  {
    "ipc_section": "376",
    "ipc_title": "Punishment for rape",
    "bns_section": "64",
    "bns_title": "Punishment for rape",
    "change_type": "Modified",
    "summary_of_change": "Minimum sentence increased in certain aggravated circumstances. Community service not applicable here.",
    "text_ipc": "Whoever, commits an offence punishable under sub-section (1) or sub-section (2) of section 376 and in the course of such commission inflicts an injury which causes the death of the woman or causes the woman to be in a persistent vegetative state, shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, or with death.",
    "text_bns": "(1) Whoever, except in the cases provided for in sub-section (2), commits rape, shall be punished with rigorous imprisonment of either description for a term which shall not be less than ten years, but which may extend to imprisonment for life, and shall also be liable to fine.\n(2) Whoever,—\n(a) being a police officer, commits rape,—\n(i) within the limits of the police station to which such police officer is appointed; or\n(ii) in the premises of any station house; or\n(iii) on a woman in such police officer’s custody or in the custody of a police officer subordinate to such police officer; or\n(b) being a public servant, commits rape on a woman in such public servant’s custody or in the custody of a public servant subordinate to such public servant; or\n(c) being a member of the armed forces deployed in an area by the Central Government or a State Government commits rape in such area; or\n(d) being on the management or on the staff of a jail, remand home or other place of custody established by or under any law for the time being in force or of a women’s or children’s institution, commits rape on any inmate of such jail, remand home, place or institution; or\n(e) being on the management or on the staff of a hospital, commits rape on a woman in that hospital; or\n(f) being a relative, guardian or teacher of, or a person in a position of trust or authority towards the woman, commits rape on such woman; or\n(g) commits rape during communal or sectarian violence; or\n(h) commits rape on a woman knowing her to be pregnant; or\n(i) commits rape, on a woman incapable of giving consent; or\n(j) being in a position of control or dominance over a woman, commits rape on such woman; or\n(k) commits rape on a woman suffering from mental or physical disability; or\n(l) while committing rape causes grievous bodily harm or maims or disfigures or endangers the life of a woman; or\n(m) commits rape repeatedly on the same woman, shall be punished with rigorous imprisonment for a term which shall not be less than ten years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person’s natural life, and shall also be liable to fine.\nExplanation.—For the purposes of this sub-section,—\n(a) “armed forces” means the naval, army and air forces and includes any member of the Armed Forces constituted under any law for the time being in force, including the paramilitary forces and any auxiliary forces that are under the control of the Central Government or the State Government;\n(b) “hospital” means the precincts of the hospital and includes the precincts of any institution for the reception and treatment of persons during convalescence or of persons requiring medical attention or rehabilitation;\n(c) “police officer” shall have the same meaning as assigned to the expression “police” under the Police Act, 1861 (5 of 1861);\n(d) “women’s or children’s institution” means an institution, whether called an orphanage or a home for neglected women or children or a widow’s home or an institution called by any other name, which is established and maintained for the reception and care of women or children."
  },
  {
    "ipc_section": "420",
    "ipc_title": "Cheating and dishonestly inducing delivery of property",
    "bns_section": "318",
    "bns_title": "Cheating",
    "change_type": "Restructured",
    "summary_of_change": "Consolidated under Section 318. 'Dishonestly' and 'Fraudulently' definitions refined in BNS.",
    "text_ipc": "Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy the whole or any part of a valuable security, or anything which is signed or sealed, and which is capable of being converted into a valuable security, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
    "text_bns": "(1) Whoever, by deceiving any person, fraudulently or dishonestly induces the person so deceived to deliver any property to any person, or to consent that any person shall retain any property, or intentionally induces the person so deceived to do or omit to do anything which he would not do or omit if he were not so deceived, and which act or omission causes or is likely to cause damage or harm to that person in body, mind, reputation or property, is said to cheat.\nExplanation.—A dishonest concealment of facts is a deception within the meaning of this section.\nIllustrations.\n\n(a) A, by falsely pretending to be in the Civil Service, intentionally deceives Z, and thus dishonestly induces Z to let him have on credit goods for which he does not mean to pay. A cheats.\n(b) A, by putting a counterfeit mark on an article, intentionally deceives Z into a belief that this article was made by a certain celebrated manufacturer, and thus dishonestly induces Z to buy and pay for the article. A cheats.\n(c) A, by exhibiting to Z a false sample of an article intentionally deceives Z into believing that the article corresponds with the sample, and thereby dishonestly induces Z to buy and pay for the article. A cheats.\n(d) A, by tendering in payment for an article a bill on a house with which A keeps no money, and by which A expects that the bill will be dishonoured, intentionally deceives Z, and thereby dishonestly induces Z to deliver the article, intending not to pay for it. A cheats.\n(e) A, by pledging as diamonds articles which he knows are not diamonds, intentionally deceives Z, and thereby dishonestly induces Z to lend money. A cheats.\n(f) A intentionally deceives Z into a belief that A means to repay any money that Z may lend to him and thereby dishonestly induces Z to lend him money, A not intending to repay it. A cheats.\n(g) A intentionally deceives Z into a belief that A means to deliver to Z a certain quantity of indigo plant which he does not intend to deliver, and thereby dishonestly induces Z to advance money upon the faith of such delivery. A cheats; but if A, at the time of obtaining the money, intends to deliver the indigo plant, and afterwards breaks his contract and does not deliver it, he does not cheat, but is liable only to a civil action for breach of contract.\n(h) A intentionally deceives Z into a belief that A has performed A’s part of a contract made with Z, which he has not performed, and thereby dishonestly induces Z to pay money. A cheats.\n(i) A sells and conveys an estate to B. A, knowing that in consequence of such sale he has no right to the property, sells or mortgages the same to Z, without disclosing the fact of the previous sale and conveyance to B, and receives the purchase or mortgage money from Z. A cheats.\n(2) Whoever cheats shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.\n(3) Whoever cheats with the knowledge that he is likely thereby to cause wrongful loss to a person whose interest in the transaction to which the cheating relates, he was bound, either by law, or by a legal contract, to protect, shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.\n(4) Whoever cheats and thereby dishonestly induces the person deceived to deliver any property to any person, or to make, alter or destroy the whole or any part of a valuable security, or anything which is signed or sealed, and which is capable of being converted into a valuable security, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine."
  },
  {
    "ipc_section": "124A",
    "ipc_title": "Sedition",
    "bns_section": "152",
    "bns_title": "Act endangering sovereignty, unity and integrity of India",
    "change_type": "Replaced",
    "summary_of_change": "'Sedition' term removed. Focus shifts to acts endangering sovereignty/integrity. Punishment can extend to life imprisonment.",
    "text_ipc": "Whoever by words, either spoken or written, or by signs, or by visible representation, or otherwise, brings or attempts to bring into hatred or contempt, or excites or attempts to excite disaffection towards, the Government established by law in India, a shall be punished with imprisonment for life, to which fine may be added, or with imprisonment which may extend to three years, to which fine may be added, or with fine.",
    "text_bns": "Whoever, purposely or knowingly, by words, either spoken or written, or by signs, or by visible representation, or by electronic communication or by use of financial mean, or otherwise, excites or attempts to excite, secession or armed rebellion or subversive activities, or encourages feelings of separatist activities or endangers sovereignty or unity and integrity of India; or indulges in or commits any such act shall be punished with imprisonment for life or with imprisonment which may extend to seven years, and shall also be liable to fine.\nExplanation.—Comments expressing disapprobation of the measures, or administrative or other action of the Government with a view to obtain their alteration by lawful means without exciting or attempting to excite the activities referred to in this section do not constitute an offence under this section."
  },
  {
    "ipc_section": "141",
    "ipc_title": "Unlawful assembly",
    "bns_section": "189",
    "bns_title": "Unlawful assembly",
    "change_type": "Modified",
    "summary_of_change": "Similar definition. Punishment structure streamlined.",
    "text_ipc": "An assembly of five or more persons is designated an \"unlawful assembly\", if the common object of the persons composing that assembly is—\n(First) — To overawe by criminal force, or show of criminal force, the Central or any State Government or Parliament or the Legislature of any State, or any public servant in the exercise of the lawful power of such public servant; or\n(Second) — To resist the execution of any law, or of any legal process; or\n(Third) — To commit any mischief or criminal trespass, or other offence; or\n(Fourth) — By means of criminal force, or show of criminal force, to any person, to take or obtain possession of any property, or to deprive any person of the enjoyment of a right of way, or of the use of water or other incorporeal right of which he is in possession or enjoyment, or to enforce any right or supposed right; or\n(Fifth) — By means of criminal force, or show of criminal force, to compel any person to do what he is not legally bound to do, or to omit to do what he is legally entitled to do.\nExplanation.—An assembly which was not unlawful when it assembled, may subsequently become an unlawful assembly.",
    "text_bns": "(1) An assembly of five or more persons is designated an unlawful assembly, if the common object of the persons composing that assembly is\n(a) to overawe by criminal force, or show of criminal force, the Central Government or any State Government or Parliament or the Legislature of any State, or any public servant in the exercise of the lawful power of such public servant; or\n(b) to resist the execution of any law, or of any legal process; or\n(c) to commit any mischief or criminal trespass, or other offence; or\n(d) by means of criminal force, or show of criminal force, to any person, to take or obtain possession of any property, or to deprive any person of the enjoyment of a right of way, or of the use of water or other incorporeal right of which he is in possession or enjoyment, or to enforce any right or supposed right; or\n(e) by means of criminal force, or show of criminal force, to compel any person to do what he is not legally bound to do, or to omit to do what he is legally entitled to do.\nExplanation.An assembly which was not unlawful when it assembled, may subsequently become an unlawful assembly.\n(2) Whoever, being aware of facts which render any assembly an unlawful assembly, intentionally joins that assembly, or continues in it, is said to be a member of an unlawful assembly and such member shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\n(3) Whoever joins or continues in an unlawful assembly, knowing that such unlawful assembly has been commanded in the manner prescribed by law to disperse, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\n(4) Whoever, being armed with any deadly weapon, or with anything which, used as a weapon of offence, is likely to cause death, is a member of an unlawful assembly, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both. (5) Whoever knowingly joins or continues in any assembly of five or more persons likely to cause a disturbance of the public peace, after such assembly has been lawfully commanded to disperse, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\nExplanation.If the assembly is an unlawful assembly within the meaning of sub-section (1), the offender shall be punishable under sub-section (3).\n(6) Whoever hires or engages, or employs, or promotes, or connives at the hiring, engagement or employment of any person to join or become a member of any unlawful assembly, shall be punishable as a member of such unlawful assembly, and for any offence which may be committed by any such person as a member of such unlawful assembly in pursuance of such hiring, engagement or employment, in the same manner as if he had been a member of such unlawful assembly, or himself had committed such offence.r under his control any persons knowing that such persons have been hired, engaged or employed, or are about to be hired, engaged or employed, to join or become members of an unlawful assembly, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\n(8) Whoever is engaged, or hired, or offers or attempts to be hired or engaged, to do or assist in doing any of the acts specified in sub-section (1), shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.\n(9) Whoever, being so engaged or hired as referred to in sub-section (8), goes armed, or engages or offers to go armed, with any deadly weapon or with anything which used as a weapon of offence is likely to cause death, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both."
  },
  {
    "ipc_section": "499",
    "ipc_title": "Defamation",
    "bns_section": "356",
    "bns_title": "Defamation",
    "change_type": "Modified",
    "summary_of_change": "Community service introduced as a punishment option.",
    "text_ipc": "Whoever by words either spoken or intended to be read, or by signs or by visible representations, makes or publishes any imputation concerning any person intending to harm, or knowing or having reason to believe that such imputation will harm, the reputation of such person, is said, except in the cases hereinafter excepted, to defame that person.",
    "text_bns": "(1) Whoever, by words either spoken or intended to be read, or by signs or by visible representations, makes or publishes in any manner, any imputation concerning any person intending to harm, or knowing or having reason to believe that such imputation will harm, the reputation of such person, is said, except in the cases hereinafter excepted, to defame that person.\nExplanation 1.---It may amount to defamation to impute anything to a deceased person, if the imputation would harm the reputation of that person if living, and is intended to be hurtful to the feelings of his family or other near relatives.\nExplanation 2.---It may amount to defamation to make an imputation concerning a company or an association or collection of persons as such.\nExplanation 3.---An imputation in the form of an alternative or expressed ironically, may amount to defamation.\nExplanation 4.---No imputation is said to harm a person’s reputation, unless that imputation directly or indirectly, in the estimation of others, lowers the moral or intellectual character of that person, or lowers the character of that person in respect of his caste or of his calling, or lowers the credit of that person, or causes it to be believed that the body of that person is in a loathsome state, or in a state generally considered as disgraceful.\nIllustrations.\n\n(a) A says---\"Z is an honest man; he never stole B’s watch\"; intending to cause it to be believed that Z did steal B’s watch. This is defamation, unless it falls within one of the exceptions.\n(b) A is asked who stole B’s watch. A points to Z, intending to cause it to be believed that Z stole B’s watch. This is defamation, unless it falls within one of the exceptions.\n(c) A draws a picture of Z running away with B’s watch, intending it to be believed that Z stole B’s watch. This is defamation, unless it falls within one of the exceptions.\nException 1.---It is not defamation to impute anything which is true concerning any person, if it be for the public good that the imputation should be made or published. Whether or not it is for the public good is a question of fact.\nException 2.---It is not defamation to express in good faith any opinion whatever respecting the conduct of a public servant in the discharge of his public functions, or respecting his character, so far as his character appears in that conduct, and no further.\nException 3.---It is not defamation to express in good faith any opinion whatever respecting the conduct of any person touching any public question, and respecting his character, so far as his character appears in that conduct, and no further.\nIllustration.\n\nIt is not defamation in A to express in good faith any opinion whatever respecting Z’s conduct in petitioning Government on a public question, in signing a requisition for a meeting on a public question, in presiding or attending at such meeting, in forming or joining any society which invites the public support, in voting or canvassing for a particular candidate for any situation in the efficient discharge of the duties of which the public is interested.\nException 4.---It is not defamation to publish substantially true report of the proceedings of a Court, or of the result of any such proceedings.\nExplanation.---A Magistrate or other officer holding an inquiry in open Court preliminary to a trial in a Court, is a Court within the meaning of the above section.\nException 5.---It is not defamation to express in good faith any opinion whatever respecting the merits of any case, civil or criminal, which has been decided by a Court, or respecting the conduct of any person as a party, witness or agent, in any such case, or respecting the character of such person, as far as his character appears in that conduct, and no further.\nIllustrations.\n\n(a) A says---\"I think Z’s evidence on that trial is so contradictory that he must be stupid or dishonest\". A is within this exception if he says this in good faith, in as much as the opinion which he expresses respects Z’s character as it appears in Z’s conduct as a witness, and no further.\n(b) But if A says---\"I do not believe what Z asserted at that trial because I know him to be a man without veracity\"; A is not within this exception, in as much as the opinion which expresses of Z’s character, is an opinion not founded on Z’s conduct as a witness.\nException 6.---It is not defamation to express in good faith any opinion respecting the merits of any performance which its author has submitted to the judgment of the public, or respecting the character of the author so far as his character appears in such performance, and no further.\nExplanation.---A performance may be submitted to the judgment of the public expressly or by acts on the part of the author which imply such submission to the judgment of the public.\nIllustrations.\n\n(a) A person who publishes a book, submits that book to the judgment of the public.\n(b) A person who makes a speech in public, submits that speech to the judgment of the public.\n(c) An actor or singer who appears on a public stage, submits his acting or singing to the judgment of the public.\n(d) A says of a book published by Z---\"Z’s book is foolish; Z must be a weak man. Z’s book is indecent; Z must be a man of impure mind\". A is within the exception, if he says this in good faith, in as much as the opinion which he expresses of Z respects Z’s character only so far as it appears in Z’s book, and no further.\n(e) But if A says \"I am not surprised that Z’s book is foolish and indecent, for he is a weak man and a libertine\". A is not within this exception, in as much as the opinion which he expresses of Z’s character is an opinion not founded on Z’s book.\nException 7.---It is not defamation in a person having over another any authority, either conferred by law or arising out of a lawful contract made with that other, to pass in good faith any censure on the conduct of that other in matters to which such lawful authority relates.\nIllustration.\n\nA Judge censuring in good faith the conduct of a witness, or of an officer of the Court; a head of a department censuring in good faith those who are under his orders, a parent censuring in good faith a child in the presence of other children; a school master, whose authority is derived from a parent, censuring in good faith a pupil in the presence of other pupils; a master censuring a servant in good faith for remissness in service; a banker censuring in good faith the cashier of his bank for the conduct of such cashier as such cashier are within this exception.\nException 8.---It is not defamation to prefer in good faith an accusation against any person to any of those who have lawful authority over that person with respect to the subject-matter of accusation.\nIllustration.\n.\nIf A in good faith accuses Z before a Magistrate; if A in good faith complains of the conduct of Z, a servant, to Z’s master; if A in good faith complains of the conduct of Z, a child, to Z’s father, A is within this exception.\nException 9.---It is not defamation to make an imputation on the character of another provided that the imputation be made in good faith for the protection of the interests of the person making it, or of any other person, or for the public good.\nIllustration.\n.\n(a) A, a shopkeeper, says to B, who manages his business---\"Sell nothing to Z unless he pays you ready money, for I have no opinion of his honesty\". A is within the exception, if he has made this imputation on Z in good faith for the protection of his own interests.\n(b) A, a Magistrate, in making a report to his own superior officer, casts an imputation on the character of Z. Here, if the imputation is made in good faith, and for the public good, A is within the exception.\nException 10.---It is not defamation to convey a caution, in good faith, to one person against another, provided that such caution be intended for the good of the person to whom it is conveyed, or of some person in whom that person is interested, or for the public good.\n(2) Whoever defames another shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both, or with community service.\n(3) Whoever prints or engraves any matter, knowing or having good reason to believe that such matter is defamatory of any person, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both.\n(4) Whoever sells or offers for sale any printed or engraved substance containing defamatory matter, knowing that it contains such matter, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both."
  },
  {
    "ipc_section": "395",
    "ipc_title": "Punishment for dacoity",
    "bns_section": "310",
    "bns_title": "Dacoity",
    "change_type": "Same",
    "summary_of_change": "Retains life imprisonment or rigorous imprisonment up to 10 years.",
    "text_ipc": "Whoever commits dacoity shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
    "text_bns": "(1) When five or more persons conjointly commit or attempt to commit a robbery, or where the whole number of persons conjointly committing or attempting to commit a robbery, and persons present and aiding such commission or attempt, amount to five or more, every person so committing, attempting or aiding, is said to commit dacoity.\n(2) Whoever commits dacoity shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.\n(3) If any one of five or more persons, who are conjointly committing dacoity, commits murder in so committing dacoity, every one of those persons shall be punished with death, or imprisonment for life, or rigorous imprisonment for a term which shall not be less than ten years, and shall also be liable to fine.\n(4) Whoever makes any preparation for committing dacoity, shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.\n(5) Whoever is one of five or more persons assembled for the purpose of committing dacoity, shall be punished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine.\n(6) Whoever belongs to a gang of persons associated for the purpose of habitually committing dacoity, shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine."
  },
  {
    "ipc_section": "509",
    "ipc_title": "Word, gesture or act intended to insult the modesty of a woman",
    "bns_section": "79",
    "bns_title": "Word, gesture or act intended to insult the modesty of a woman",
    "change_type": "Modified",
    "summary_of_change": "Included new digital/electronic means of communication.",
    "text_ipc": "Whoever, intending to insult the modesty of any woman, utters any word, makes any sound or gesture, or exhibits any object, intending that such word or sound shall be heard, or that such gesture or object shall be seen, by such woman, or intrudes upon the privacy of such woman, shall be punished with simple imprisonment for a term which may extend to three years, and also with fine.",
    "text_bns": "Whoever, intending to insult the modesty of any woman, utters any words, makes any sound or gesture, or exhibits any object in any form, intending that such word or sound shall be heard, or that such gesture or object shall be seen, by such woman, or intrudes upon the privacy of such woman, shall be punished with simple imprisonment for a term which may extend to three years, and also with fine."
  }
]
